<?
//----------------ВХОДНЫЕ ДАННЫЕ---------------

//кол-во переменных
$x = 2;
//кол-во неравинств
$n = 3;
//массив определяющий целевую функцию
$arr1 = array (1,1);
//переменная определяющая куда стремиться ЦФ, по умолчанию к max
$m = 'max';
//$m = 'min';
//массив определяющий векторы А (неравенства)
$arr2 = array (
                array (1,-5,2),
                array (2,-3,-3)
              );

//массив с типами неравенств -1 меньше_равно, 0 равно, 1 больше_равно
$nn = array (-1,1,-1);
//масив определяющий опорное решение
$arr3 = array (14,15,12);


//---------------ПРИВОДИМ ДАННЫХ--------------

//меняем знак целевой функциие если задача на минимум
if($m == 'min'){
    for ($i=0;$i<$x;$i++){
        $arr1_i[$i] = $arr1[$i]*(-1);
    }
    $arr1 = $arr1_i;
}
//неравенства со знаком больше_равно
$nn_b = array_keys($nn, 1);
//меняем знак неравенств больше_равно
if (count($nn_b)>0){
    for($i=0;$i<count($nn_b);$i++) {
        for($j=0;$j<$x;$j++) {
            $arr2[$j][$nn_b[$i]]*=(-1);
        }
        $arr3[$nn_b[$i]]*=(-1);
    }
}
//равенства
$nn_r = array_keys($nn, 0);
//вводим искуственый базис 
for ($i=0;$i<$n+$x;$i++){
    for ($j=0;$j<$n;$j++){
        if(empty($arr2[$i][$j])){
            if (($j+$x) == $i) {
                $arr2[$i][$j] = 1;
            } else {
                $arr2[$i][$j] = 0;
            }
        }
    }
    if(empty($arr1[$i])){
        $arr1[$i] = 0;
    }
}
echo'<pre>';
print_r($arr1);
print_r($arr2);
echo'</pre>';
//массив с номерами векторов образующих базис
for ($i=0;$i<$n;$i++) {
    $Ai[$i] = $x+$i;
}
//массив Cb
for ($i=0;$i<$n;$i++) {
    //$q = $Ai[$i];
    $Cb[$i] = $arr1[$Ai[$i]];
}
//массив оценок
for ($i=0;$i<$x;$i++){
    $ar = array_map(function ($el1, $el2) {
        return $el1 * $el2;
    },
    $Cb, $arr2[$i]);
    $ai[$i] = array_sum($ar) - $arr1[$i];
}
?>