<?php
//--------------ВХОДНЫЕ ДАННЫЕ-----------

//кол-во переменных
$x = 4;
//кол-во неравинств
$n = 7;

//массив определяющий целевую функцию
$arr1 = array (315,278,573,370,0,0,0,0,0,0,0);
//переменная определяющая куда стремиться ЦФ, по умолчанию к max
$m = 'max';
//$m = 'min';

//меняем знак целевой функциие если задача на минимум
if($m == 'min'){
    for ($i=0;$i<$x;$i++){
        $arr1_i[$i] = $arr1[$i]*(-1);
    }
    $arr1 = $arr1_i;
}

//массив определяющий векторы А (неравенства)
$arr2 = array (
                array (550,40,86,160,0,3,4.5),
                array (620,30,110,92,158,4,4.5),
                array (0,20,150,158,30,3,4.5),
                array (0,20,52,128,50,4,4.5),
                array (1,0,0,0,0,0,0),
                array (0,1,0,0,0,0,0),
                array (0,0,1,0,0,0,0),
                array (0,0,0,1,0,0,0),
                array (0,0,0,0,1,0,0),
                array (0,0,0,0,0,1,0),
                array (0,0,0,0,0,0,1)
              );

//масив определяющий опорное решение
$arr3 = array (64270,4800,22360,26240,7900,520,720);

//массив с номерами векторов образующих базис
for ($i=0;$i<$n;$i++) {
    $Ai[$i] = $x+$i;
}

//массив Cb
for ($i=0;$i<$n;$i++) {
    //$q = $Ai[$i];
    $Cb[$i] = $arr1[$Ai[$i]];
}

//массив оценок
for ($i=0;$i<$x;$i++){
    $ar = array_map(function ($el1, $el2) {
        return $el1 * $el2;
    },
    $Cb, $arr2[$i]);
    $ai[$i] = array_sum($ar) - $arr1[$i];
}
?>
